# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = [25, 36.6, -41, "one", True]
print(my_list)

while my_list:
    print(type(my_list.pop(0)))
